In [1]:
import pandas as pd

In [2]:
df = pd.read_html('http://sos.ga.gov/elections/election_results/2006_1107/022.htm')

In [3]:
df = df[0]

In [4]:
df.head(5)

          0    1    2                   3                   4
0       NaN  NaN  NaN  Price (R)  144,958  Sinton (D)  55,294
1       NaN  NaN  NaN               72.4%               27.6%
2    County   PR   TP                 NaN                 NaN
3  CHEROKEE   46   46               37863               10360
4      COBB   67   67               40897               16423

In [5]:
df = df[3:]

In [6]:
df.head(5)

          0    1    2      3      4
3  CHEROKEE   46   46  37863  10360
4      COBB   67   67  40897  16423
5    DEKALB   24   24  11530   6143
6    FULTON  113  113  54668  22368

In [7]:
df = df.drop(df.columns[[1,2]], axis=1)

In [8]:
df.head(5)

          0      3      4
3  CHEROKEE  37863  10360
4      COBB  40897  16423
5    DEKALB  11530   6143
6    FULTON  54668  22368

In [9]:
df.columns = ['county', 'Tom Price', 'Steve Sinton']

In [10]:
df.tail(5)

     county Tom Price Steve Sinton
3  CHEROKEE     37863        10360
4      COBB     40897        16423
5    DEKALB     11530         6143
6    FULTON     54668        22368

In [11]:
df = df.melt(id_vars=['county'])

In [12]:
df.columns = ['county', 'candidate', 'votes']

In [13]:
df.head()

     county     candidate  votes
0  CHEROKEE     Tom Price  37863
1      COBB     Tom Price  40897
2    DEKALB     Tom Price  11530
3    FULTON     Tom Price  54668
4  CHEROKEE  Steve Sinton  10360

In [14]:
df['votes'] = df['votes'].astype(int)

In [15]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 3 columns):
county       8 non-null object
candidate    8 non-null object
votes        8 non-null int64
dtypes: int64(1), object(2)
memory usage: 272.0+ bytes

In [16]:
df['office'] = 'U.S. Representative'

In [17]:
df['district'] = '6'

In [18]:
df['party'] = ''

In [20]:
df.loc[df['candidate'] == 'Tom Price', 'party'] = 'Republican'
df.loc[df['candidate'] == 'Steve Sinton', 'party'] = 'Democrat'

In [21]:
df.groupby(['candidate', 'party'])['votes'].sum()

candidate     party
Steve Sinton  Democrat       55294
Tom Price     Republican    144958
Name: votes, dtype: int64

In [22]:
df[['county', 'office', 'district', 'party', 'candidate', 'votes']].head()

     county               office district       party     candidate  votes
0  CHEROKEE  U.S. Representative        6  Republican     Tom Price  37863
1      COBB  U.S. Representative        6  Republican     Tom Price  40897
2    DEKALB  U.S. Representative        6  Republican     Tom Price  11530
3    FULTON  U.S. Representative        6  Republican     Tom Price  54668
4  CHEROKEE  U.S. Representative        6    Democrat  Steve Sinton  10360

In [23]:
df[['county', 'office', 'district', 'party', 'candidate', 'votes']].to_clipboard(index=False, sep=',')